package ch4;

/*
 * ch4. 주석
 *
 * 주석 : 실패를 표현
 * 코드는 변화하고 진화하지만 주석은 따라가지 못함
 * 주석에 힘쓸 노력으로 주석이 필요없는 코드를 작성하는 데 쏟아야 함
 *
 * # 주석은 나쁜 코드를 보완하지 못한다
 * 주석을 짜는 이유 : 코드 품질이 나빠서
 * 주석을 달아야겠다!   x
 * 코드를 정리해야겠다   o
 * 
 * # 코드로 의도를 표현하라
 * 주석을 쓰지 않아도 코드만으로 의미를 나타낼 수 있으며 더 뛰어남
 *
 * # 좋은 주석
 * - 법적인 주석
 *  저작권 정보, 소유권 정보, 라이선스 등
 * - 정보를 제공하는 주석
 *  가능하면 함수 이름에 정보를 담거나
 *  변환 클래스를 만들면 좋음
 * - 의도를 설명하는 주석
 *  결정에 깔린 의도를 설명
 * - 의미를 명료하게 밝히는 주석
 *  인수나 반환값이 표준 라이브러리나 변경하지 못하는 코드에 속하면
 *  의미를 명료하게 밝히는 주석이 유용
 * - 결과를 경고하는 주석
 * - TODO 주석
 *  필요하다고 여기지만 당장 구현하기 어려운 업무 기술
 *  나쁜 코드를 고치지 않을 핑계가 되면 안 됨
 * - 중요성을 강조하는 기술
 *  대수롭지 않다고 여겨질 뭔가의 중요성을 강조
 * - 공개 API에서 Javadocs
 *
 * # 나쁜 주석
 * - 주절거리는 주석
 *  주석을 달아야 한다면 최고의 주석을 달아야 함
 * - 같은 이야기를 중복하는 주석
 *  주석과 코드가 같은 내용을 중복하면 안 됨
 *  중복된 주석은 코드를 지저분하고 정신없게 만듦
 * - 오해할 여지가 있는 주석
 * - 의무적으로 다는 주석
 * - 이력을 기록하는 주석
 *  소스코드 관리 시스템이 있어서 이젠 방해됨
 * - 있으나 마나 한 주석
 *  너무 당연한 사실 언급
 * - 무서운 잡음
 * 
 * # 함수나 변수로 표현할 수 있다면 주석을 달지 마라
 * 주석보다 코드로 표현
 * 
 * # 위치를 표시하는 주석
 * 가독성을 낮춰서 제거
 *
 * # 닫는 괄호에 다는 주석
 * 작고 캡슐화된 함수에서는 잡음임
 * 닫는 괄호 주석 대신 함수 크기들 줄여라
 *
 * # 공로를 돌리거나 저자를 표시하는 주석
 * 코드 관리 시스템이 있으니 쓰지마라
 *
 * # 주석으로 처리한 코드
 * 주석 처리 코드는 혹시나 싶어서 안지우는 경향이 있어서
 * 쓸데없이 코드가 더러워짐
 * 코드 관리 시스템이 코드 수정을 기억해주니까 그냥 지워라
 *
 * # HTML 주석
 * 주석을 웹 페이지로 변환하는 것은 툴이 하는 일이지
 * 프로그래머가 할 일이 아님
 * 
 * # 전역 정보
 * 주석은 근처 코드만 기술해야 하고
 * 코드 일부 주석에 시스템 전반적 정보를 기술하면 안 됨
 *
 * # 너무 많은 정보
 * 쓸데없는 정보를 넣지 마라
 *
 * # 모호한 관계
 * 조석-코드 관계가 명백해야 함
 * 
 * # 함수 헤더
 * 함수를 짧고 한 일만 하고 좋은 이름으로 만드는 것이
 * 헤더 다는것보다 나음
 *
 * # 비공개 코드에서 Javadocs
 * 공개 API는 Javadocs가 유용하지만
 * 비공개 코드는 Javadocs가 필요없음
 * 형식에 맞추느라 코드가 산만해짐
 *
 * # 예제
 * 코드를 잘 못짜면 주석이 많아짐
 * 주석의 목적은 코드 이해를 돕는 것
 * 주석이 있는게 낫다면 달고, 없어도 되면 달지 마라
 */
public class ch4 {
}
